//Оператор if 
// Оператор if («если») создает условие. Он вычисляет его, и если результат – true, то выполняет команду.

// var year = prompt('В каком году появилась спецификация ECMA-262 5.1?', '');
// if (year != 2011) alert( 'А вот и неправильно!' );

// Если нужно выполнить более одной команды – они оформляются блоком кода в фигурных скобках:
// if (year != 2011) {
//     alert( 'А вот..' );
//     alert( '..и неправильно!' );
// }

//Оператор if (...) вычисляет и преобразует выражение в скобках к логическому типу
// В логическом контексте: Число 0, пустая строка "", null и undefined, а также NaN являются false,
// Остальные значения – true.
// if (0) { // 0 преобразуется к false
//     ...
// }
// if (1) { // 1 преобразуется к true
//     ...
// }

// Необязательный блок else («иначе») выполняется, если условие неверно:
// var year = prompt('Введите год появления стандарта ECMA-262 5.1', '');
// if (year == 2011) {
//   alert( 'Да вы знаток!' );
// } else {
//   alert( 'А вот и неправильно!' ); // любое значение, кроме 2011
// }

// Если нужно проверить несколько вариантов условия - используется блок else if ...
// var year = prompt('В каком году появилась спецификация ECMA-262 5.1?', '');
// if (year < 2011) {
//   alert( 'Это слишком рано..' );
// } else if (year > 2011) {
//   alert( 'Это поздновато..' );
// } else {
//   alert( 'Да, точно в этом году!' );
// }

// Иногда нужно в зависимости от условия присвоить переменную.
// var access;
// var age = prompt('Сколько вам лет?', '');
// if (age > 14) {
//   access = true;
// } else {
//   access = false;
// }
// alert(access);
// Оператор вопросительный знак '?' позволяет делать это короче и проще. 
// access = age > 14 ? true : false;
// Вопросительный знак - «тернарный оператор»  у которого есть аж три аргумента 
// Синтаксис: условие ? значение1 : значение2
// Проверяется условие, затем если оно верно – возвращается значение1, если неверно – значение2

//Последовательность операторов '?' позволяет вернуть значение в зависимости не от одного условия, а от нескольких
// var age = prompt('возраст?', 18);
// var message = (age < 3) ? 'Здравствуй, малыш!' :
//   (age < 18) ? 'Привет!' :
//   (age < 100) ? 'Здравствуйте!' :
//   'Какой необычный возраст!';
// alert( message );
// То же самое через if..else
// if (age < 3) {
//     message = 'Здравствуй, малыш!';
//   } else if (age < 18) {
//     message = 'Привет!';
//   } else if (age < 100) {
//     message = 'Здравствуйте!';
//   } else {
//     message = 'Какой необычный возраст!';
//   }

// Иногда оператор вопросительный знак '?' используют как замену if.

// То есть, запись:
// if (условие) {
//     a();
//   } else {
//     b();
// }
// Аналогична записи:
// условие ? a() : b();

// В обоих случаях в зависимости от условия выполняется либо a() либо b(). Но разница состоит в том, что оператор вопросительный знак '?', возвращает значение.
//  Для проверки условия предпочтителен if. для проверки условия предпочтителен if.

// var company = prompt('Какая компания создала JavaScript?', '');
// (company == 'Netscape') ?
// alert('Да, верно') : alert('Неправильно');
// Рекомендуется не использовать вопросительный знак таким образом т.к. является существенно менее читаемой; 
// то же самое с if 
// var company = prompt('Какая компания создала JavaScript?', '');
// if (company == 'Netscape') {
//   alert('Да, верно');
// } else {
//   alert('Неправильно');
// }




//                                          П Р И К Л А Д И




//Чи виведеться alert?

// if ("0") {
//     alert ("Друзі, Привіт!"); // виведеться, бо будь-який НЕПУСТИЙ РЯДОК в логічному контексті є true
// }
// console.log();


/*Написати код, який буде питати яка офіційна назва "JavaScript" ? 
Якщо користувач вводить "EcmaScript", то вивести "Правельно!", a якщо щось інше - 
тo виводить "Хіба не знаєте? Це ж EcmaScript" */

// let value = prompt ("Яка офіційна назва \"JavaScript\" ?");
// if (value == "EcmaScript") {
//     alert ("Правельно!");
// } else {
//     alert ("Хіба не знаєте? Це ж EcmaScript");
// }

/*Написати код, який буде запитувати пароль (через prompt). Якщо відвідувач вводить
"Lady Gaga", то вивести "Вітаємо", якщо введено неправельний пароль, то вивести "Хтось забув пароль ?"*/
// let pass = "Lady Gaga";
// let userPass = prompt("Ваш пароль ?");
// if(pass == userPass) {
//     alert("Вітаємо у нас знову");
// } else { 
//     alert("Хтось забув пароль?");
// }

/*Використовуючи конструкцію if...else написати код, який отримує значення prompt,
а потім виводить alert: 1 - якщо значення більше 0; -1 - якщо значення менше 0; та 
0 - якщо значення дорівнює 0.*/

// let value = prompt ("Введіть число", 0);
// if (value < 0) {
//     alert ("-1");
// } else if (value > 0) {
//     alert ("1");
// } else {
//     alert ("0");
// }



/*Переписати даний код з if...else з використанням оператора ?
Код який потрібно переробити наданий нижче:
let age = +prompt('Скільки вам років?');
if(age > 16) {
    answer = 'Ласкаво просимо в клуб';
}
else {
    answer = 'Зроби паспорт в фотошопі';
} 
*/

// Рішення:
// let age = +prompt('Скільки вам років?');
// let answer = (age > 16) ? 'Ласкаво просимо в клуб' : 'Зроби паспорт в фотошопі';
// console.log(answer);



/*Переписати подібний код з if...else, але трохи ускладнений, і також з використанням оператора ?
Код який потрібно переробити наданий нижче:
let age = +prompt('Скільки вам років?');
if(age > 16) {
    if (age > 21) {
        answer = 'Підемо в клуб для дорослих "Silver Dolls"';
    } else {
        answer = 'Будем пити пиво в барі "Irish Pub"';
    }
} else {
    answer = 'Зроби паспорт в фотошопі';
}
*/

// Рішення: 
// let age = +prompt('Скільки вам років?');
// let answer = (age > 16) ? ((age > 21) ? 'Підемо в клуб для дорослих "Silver Dolls"': 'Будем пити пиво в барі "Irish Pub"'): 'Зроби паспорт в фотошопі';
// console.log(answer);





/*Використовуючи конструкцію if...else написати код, який запитує номер кредитної картки
і якщо відвідувач нічого не ввів то запитати знову ввести номер картки, а якщо відмінив ввід
 натиснувши Cansel чи Esc то процедуру відмінити повідомивши його про це. */
// let ask = prompt("Введіть номер Вашої кредитної картки використовуючи числовий набір.");
// if(ask === "") {
//     ask = prompt("Ви не ввели, введіть номер!");
// }
// else if(ask === null) {
//     alert("Напевно, не дуже Вам хотілось цього разу, до зустрічі.");
// }

/*Написати код, який буде запитувати логін (через prompt). Якщо відвідувач вводить
"Адмін", то запитує пароль, якщо натиснути відміну (Esc),то виводить "Вхід відмінений"
якщо введено щось інше, то виводить "Я Вас не знаю". Крім того, пароль перевіряється
так: якщо введений "Чорний володар", то виводить "Ласкаво прошу", інакше - "Пароль невірний",
а якщо натисне відміну (Esc), то вивести "Вхід відмінений"*/
// let userName = prompt("Хто запитує?");
// if (userName == "Адмін") {
//     let pass = prompt ("Введіть пароль", " ");
//     if (pass == "Чорний володар") {
//         alert ("Ласкаво прошу");
//     } else if (pass == null) {
//         alert ("Вхід відмінений");
//     } else {
//         alert ("Пароль невірний");
//     }
// } else if ("userName == null") {
//     alert ("Вхід відмінений");
// } else {
//     alert ("Я Вас не знаю");
// }

/*Переписати if з використанням оператора ?
if (a + b < 4) {
    result = "Мало";
} else {
    result = "Багато";
}
*/
// result = (a + b < 4)? "Мало": "Багато";

// /* Переписати if...else з використанням декількох операторів ?
// let message;
// let login = "Вася";
// if (login == "Вася") {
//     message = "Привіт Вася!";
//     alert(message); 
// } else if (login == "Директор"){
//     message = "Доброго дня";
//     alert(message);
// } else if (login == " "){
//     message = "Логін не введений";
//     alert(message);
// } else {
//     message = " ";
//     alert(message);
// }

// let login = "Вася";
// var message = (login == "Вася") ? "Привіт Вася!" : 
//               (login == "Директор") ? "Доброго дня" : 
//               (login == " ") ? "Логін не введений":
//               " ";
// console.log(message);




/*Написати код, який буде запитувати вік та в залежності від віку напраляти 
в різні місця. При перевірці віку зробити перевірку на введення від 
порожннього рядку, нечислового введення віку та коли користувач натисне 
відміну (Cansel/Esc).*/ 
// let age = prompt("Ваш вік?", 22);
// // age = checkPromptToNumber(age);
// // if(age === null || age === '' || isNaN(age)) {
// //     alert("Тоді на зореліт \"АБСТРАКТНА ДЕЛЕЧІНЬ\" і в космос");
// // }
// if (age <= 18) {
//     alert("Тоді вам на площадку для розваг");
// } else if (age <= 25) {
//     alert("Тоді вам в кімнату для гостей");
// } else if (age <= 55) {
//     alert("Нічний клуб за рогом вулиці");
// } else if (age <= 80) {
//     alert("Бібліотека на 8 поверсі");
// } else {
//     alert("Який достойний вік. В нашому саді затишно і багато квітів");
// }